'use strict' //строгий режим

// Ошибки начинающих при работе с циклом while в JavaScript

// Задача 1
// В следующем коде программист вывел числа от 10 до 1:
// let i = 10;

// while (i >= 1) {
// 	console.log(i);
// 	--i
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что цикл выполняется бесконечно. Исправьте ошибку программиста.

// Задача 2
// В следующем коде программист вывел числа от 10 до 1:
// let i = 10;

// while (i >= 1) {
// 	console.log(i);
// 	i--;
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что цикл выполняется бесконечно. Исправьте ошибку программиста.

// Задача 3
// В следующем коде программист вывел числа от 10 до 1:
// let i = 10;

// while (i >= 0) {
// 	console.log(i);
// 	i--;
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что на экран ничего не вывелось. Исправьте ошибку программиста.

// Задача 4
// В следующем коде программист вывел числа от 10 до 1:
// let i = 10;

// while (i >= 0) {
// 	console.log(i);
// 	i--;
// }
// В коде, однако, была допущена ошибка, которая привела к тому, что на экран ничего не вывелось. Исправьте ошибку программиста.

// Задача 5
// В следующем коде программист вывел числа от 10 до 1:
let i = 10;

while (i >= 10) {
	console.log(i);
	i--;
}
// В коде, однако, была допущена ошибка, которая привела к тому, что цикл вывел только число 10 и закончил свою работу. Исправьте ошибку программиста.