'use strict' //строгий режим

// Изменение массива в цикле JavaScript

// Задача 1
// Дан массив с числами. Переберите этот массив циклом и возведите каждый элемент этого массива в квадрат.
// let arr = [3, 6, 7, 10, 2, 5];
// arr[0] = arr[0] ** 2
// arr[1] = arr[1] ** 2
// arr[2] = arr[2] ** 2
// arr[3] = arr[3] ** 2
// arr[4] = arr[4] ** 2
// arr[5] = arr[5] ** 2
// console.log(arr) // [9, 36, 49, 100, 4, 25]

// Сокращенные операции

// Задача 2
// Дан массив с числами. Переберите этот массив циклом и отнимите от каждого элемента единицу.
// let arr = [2, 7, 9, 3, 5, 1, 6];
// for (let i = 0; i < arr.length; i++){
// 	arr[i] -= 1
// }
// console.log(arr) //[1, 6, 8, 2, 4, 0, 5]

// Задача 3
// Дан массив с числами. Переберите этот массив циклом и прибавьте к каждому элементу 10.
// let arr = [2, 233, 43, 12, 89, 42, 53, 78, 48];
// for (let i = 0; i < arr.length; i++){
// 	arr[i] += 10;
// }
// console.log(arr) //[12, 243, 53, 22, 99, 52, 63, 88, 58]

// Задача 4
// Дан массив с числами. Переберите этот массив циклом и прибавьте к каждому элементу 14.
// let arr = [1, 453, 786, 31, 57, 97, 532, 856];
// for (let i = 0; i < arr.length; i++){
// 	arr[i] += 14;
// }
// console.log(arr) //[15, 467, 800, 45, 71, 111, 546, 870]